import Control from '../../../../common/control';
import { HeaderUnauth } from '../../../header/header-unauth/header-unauth';

export class MainUnauthPage extends Control {
  constructor(parentNode: HTMLElement) {
    super(parentNode, 'div', 'container');

    new Control(this.node, 'p', 'display-3 text-center', 'А вы знаете Front-end?');
    new Control(
      this.node,
      'h6',
      'text-center display-6',
      `Данное приложение на сайте представляет собой онлайн-курс по фронтенд-разработке, включающий в себя теоретический материал, тесты и задачи.
      Пользователь может зарегистрироваться на сайте и начать проходить курс. На главной странице он сможет выбрать тему, которую он хочет изучить, и перейти на страницу с теоретическим материалом по этой теме.
      На странице с теоретическим материалом пользователь может прочитать информацию о концепциях и технологиях, связанных с фронтенд-разработкой. Кроме того, на этой странице могут быть встроены видеоуроки и интерактивные элементы, которые помогут пользователю лучше усвоить материал.
      После того, как пользователь изучил теорию, он может пройти тесты, чтобы проверить свои знания. Тесты могут быть как множественного выбора, так и открытого типа. После прохождения тестов пользователь получит обратную связь о своих знаниях и сможет перейти к следующей теме.
      На странице с задачами пользователь может попрактиковаться в написании кода. Задачи могут быть как простыми, так и сложными, и могут включать в себя использование различных технологий.
      Кроме того, приложение может содержать разделы для общения с другими участниками курса, а также для получения дополнительной информации и ресурсов по теме.`
    );

    new HeaderUnauth(this.node);
  }
}
